<?php


return [

            // ---- Общие кнопки ----

    [
        'slug' => 'text_hello',
        'name' => 'Приветствие',
        'value' => '<b>Добро пожаловать #name#! Для начала зарегистрируемся</b>',
    ],
    [
        'slug' => 'text_no_active',
        'name' => 'Текст когда аккаунт не активен',
        'value' => '🚫 <b>Ваш аккаунт не активирован. Обратитесь к администратору.</b> 🚫',
    ],
    [
        'slug' => 'text_action',
        'name' => 'Текст выбора',
        'value' => '<b>Выберите действие</b>',
    ],
    [
        'slug' => 'btn_return',
        'name' => 'Кнопка назад',
        'value' => 'Назад',
    ],
    [
        'slug' => 'btn_provider',
        'name' => 'Кнопка выбора провайдера',
        'value' => '<b>Выберете провайдера</b>',
    ],
    [
        'slug' => 'text_tg_provider',
        'name' => 'Текст телеграмм провайдера',
        'value' => '🔵 Telegram 🔵',
    ],
    [
        'slug' => 'text_whatsApp_provider',
        'name' => 'Кнопка выбора провайдера',
        'value' => '🟢 WhatsApp 🟢',
    ],
    [
        'slug' => 'btn_active_number',
        'name' => 'Кнопка активных номеров',
        'value' => 'Активные',
    ],
    [
        'slug' => 'btn_deactivate_number',
        'name' => 'Кнопка деактивированных номеров',
        'value' => 'Деактивированы',
    ],
    [
        'slug' => 'btn_bought_number',
        'name' => 'Кнопка купленных номеров',
        'value' => 'Купленные',
    ],
    [
        'slug' => 'text_status_number',
        'name' => 'Текст выбор статусов номеров',
        'value' => '<b>Выберете статус номеров</b>',
    ],
    [
        'slug' => 'text_no_stats',
        'name' => 'Текст если нет статистики',
        'value' => '❌ <b>Нет статистики.</b> ❌',
    ],
    [
        'slug' => 'text_count_numbers',
        'name' => 'Текст с количеством номеров',
        'value' => '<b>Количество номеров: #numbers#</b>',
    ],
    [
        'slug' => 'btn_stats_number',
        'name' => 'Кнопка статистики номеров (продавец/покупатель)',
        'value' => 'Ваша статистика',
    ],
    [
        'slug' => 'text_deactivate_number',
        'name' => 'Текст деактивации номера',
        'value' => '❌ Номер деактивирован: #number# ❌',
    ],
    [
        'slug' => 'text_error_unknown_number',
        'name' => 'Текст когда ответил сообщением на неизвестный номер',
        'value' => '❌ Ошибка: не удалось определить номер. Убедитесь, что вы ответили на сообщение с уведомлением о номере. ❌',
    ],
    [
        'slug' => 'text_dispute_numbers_false',
        'name' => 'Текст если не удалось получить номер',
        'value' => '❌ Ошибка: Не удалось получить номер. Попробуйте еще раз. ❌',
    ],





            // === Покупатель ===
    [
        'slug' => 'btn_buyer',
        'name' => 'Кнопка покупателя',
        'value' => 'Покупатель',
    ],
    [
        'slug' => 'btn_buy_number',
        'name' => 'Кнопка покупки номера',
        'value' => 'Купить номер',
    ],
    [
        'slug' => 'btn_get_buyer_numbers',
        'name' => 'Кнопка показа номеров покупателя',
        'value' => 'Ваши номера',
    ],
    [
        'slug' => 'text_no_numbers_for_sale',
        'name' => 'Текст когда нет номеров на продажу',
        'value' => '❌ <b>Нет доступных номеров</b> ❌',
    ],
    [
        'slug' => 'text_for_sale_numbers',
        'name' => 'Текст продажи номеров',
        'value' => '<b>Доступные номера:</b>',
    ],
    [
        'slug' => 'text_for_buy_numbers',
        'name' => 'Текст для покупки номера',
        'value' => '💰 <b>Нажав на номер вы перейдете на его покупку</b> 💰',
    ],
    [
        'slug' => 'btn_get_code',
        'name' => 'Кнопка получения кода покупателем',
        'value' => 'Получить код',
    ],
    [
        'slug' => 'text_await_code',
        'name' => 'Текст ожидания получения кода покупателем',
        'value' => '⏳ <b>Ожидайте код. Время ожидание 2 минуты. У продавца на отправку кода две попытки</b> ⏳',
    ],
    [
        'slug' => 'text_error_buy',
        'name' => 'Текст ошибки при покупке номера',
        'value' => '❌ <b>Ошибка в покупке номера. Выберете другой номер.</b> ❌',
    ],
    [
        'slug' => 'text_deactivate_repeat',
        'name' => 'Текст повтора деактивации',
        'value' => 'Если код снова не пришел деактивируйте номер',
    ],
    [
        'slug' => 'btn_deactivate_number',
        'name' => 'Кнопка деактивации номера',
        'value' => 'Деактивировать',
    ],
    [
        'slug' => 'btn_number_change',
        'name' => 'Кнопка выбора другого номера',
        'value' => 'Выбрать другой номер',
    ],
    [
        'slug' => 'text_code_sending_buyer',
        'name' => 'Текст отправки кода',
        'value' => '🔒 Код для номера #number#: #code# 🔒',
    ],
    [
        'slug' => 'btn_code_successful',
        'name' => 'Кнопка успешного кода',
        'value' => 'Код успешен',
    ],
    [
        'slug' => 'btn_code_unsuccessful',
        'name' => 'Кнопка неуспешного кода',
        'value' => 'Код неуспешен',
    ],
    [
        'slug' => 'text_buy_number_true',
        'name' => 'Текст успешной покупки номера',
        'value' => '✅ Номер #number# успешно куплен! ✅',
    ],
    [
        'slug' => 'text_buy_number_false',
        'name' => 'Текст неуспешной покупки номера',
        'value' => '❌ Номер #number# слетел! ❌',
    ],
    [
        'slug' => 'text_add_number_buyer',
        'name' => 'Текст успешного добавления номера покупателем',
        'value' => '✅ <b>Номер добавлен!</b> ✅',
    ],
    [
        'slug' => 'text_no_add_number_buyer',
        'name' => 'Текст неуспешного добавления номера покупателем',
        'value' => '❌ <b>Номер деактивирован!</b> ❌',
    ],
    [
        'slug' => 'text_bought_numbers',
        'name' => 'Текст по выборке купленных номеров',
        'value' => '<b>Количество купленных номеров: #count_numbers#. Если номер слетел в течении 10 минут, то нажмите на него </b>',
    ],
    [
        'slug' => 'text_number_dispute_not_added',
        'name' => 'Текст с номером который уже засчитан',
        'value' => '❌ Номер #number# уже засчитан ❌',
    ],
    [
        'slug' => 'text_number_dispute_added',
        'name' => 'Текст с номером который ушел на диспут',
        'value' => '🆘 Номер #number# отправлен в диспут 🆘',
    ],





            // === Продавец ===

    [
        'slug' => 'btn_seller',
        'name' => 'Кнопка продавца',
        'value' => 'Продавец',
    ],
    [
        'slug' => 'btn_add_number_seller',
        'name' => 'Кнопка добавления номера (продавец)',
        'value' => 'Добавить номер',
    ],
    [
        'slug' => 'btn_status_number_seller',
        'name' => 'Кнопка статуса номеров (продавец)',
        'value' => 'Статусы номеров',
    ],

    [
        'slug' => 'text_no_active_numbers',
        'name' => 'Текст когда нет активных номеров',
        'value' => '❌ <b>Нет активных номеров</b> ❌',
    ],
    [
        'slug' => 'text_no_deactivate_numbers',
        'name' => 'Текст когда нет неактивных номеров',
        'value' => '❌ <b>Нет неактивных номеров</b> ❌',
    ],
    [
        'slug' => 'text_no_bought_numbers',
        'name' => 'Текст когда нет купленных номеров',
        'value' => '❌ <b>Нет купленных номеров</b> ❌',
    ],
    [
        'slug' => 'btn_delete_number',
        'name' => 'Кнопка удаления номера',
        'value' => '🆘 <b>Нажав на кнопку с номером он будет удален!</b> 🆘',
    ],
    [
        'slug' => 'text_delete_number',
        'name' => 'Текст удаления номера',
        'value' => '❌ <b>Номер успешно удален!</b> ❌',
    ],
    [
        'slug' => 'text_add_tg_number',
        'name' => 'Текст удобавления номера Телеграмм',
        'value' => '📝 Введите номер 🔵 Telegram 🔵 в соответствующем порядке:\n\n<b>9003233212</b>\n\nКаждый номер начинается с новой строки 📝',
    ],
    [
        'slug' => 'text_add_whatsApp_number',
        'name' => 'Текст добавления номера WhatsApp',
        'value' => '📝 Введите номер 🟢 WhatsApp 🟢 в соответствующем порядке:\n\n<b>9003233212</b>\n\nКаждый номер начинается с новой строки 📝',
    ],
    [
        'slug' => 'text_for_await_code_number',
        'name' => 'Текст того что покупатель ожидает код',
        'value' => '⌛️ Покупатель ожидает код для номера: #number#. Пожалуйста, введите код в течении 2 минут. ⌛️',
    ],
    [
        'slug' => 'btn_for_no_code_salesman',
        'name' => 'Кнопка что код не пришел для продавца',
        'value' => 'Код не пришел',
    ],
    [
        'slug' => 'text_code_sending_salesman',
        'name' => 'Текст отправки кода для продавца',
        'value' => '✅ Код на номер #number# отправлен! ✅',
    ],

];
